Revit 2026 API

# ZoomFitType Enumeration

---

This enum is used to define type of zoom.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum ZoomFitType
```
```vb
Public Enumeration ZoomFitType
```
```cpp
public enum class ZoomFitType
```
```fsharp
type ZoomFitType
```

| Member name | Value | Description |
| --- | --- | --- |
| FitToPage | 0 | Fit the whole view into a specific image size. |
| Zoom | 1 | Calculate the size of the image using physical size of the view, zoom value and resolution. |

#### Reference

Autodesk.Revit.DB Namespace